In [1]:
import numpy as np
import pandas as pd

In [2]:
data_one = {'A':['A0','A1','A2','A3'],
           'B':['B0','B1','B2','B3']}

data_two = {'C':['C0','C1','C2','C3'],
           'D':['D0','D1','D2','D3']}

In [3]:
one = pd.DataFrame(data_one)

In [4]:
one

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [5]:
two = pd.DataFrame(data_two)

In [6]:
two

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

###### Axis = 0 | Concatenate along rows

In [8]:
axis0 = pd.concat([one,two],axis=0)
axis0

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3   A3   B3  NaN  NaN
0  NaN  NaN   C0   D0
1  NaN  NaN   C1   D1
2  NaN  NaN   C2   D2
3  NaN  NaN   C3   D3

###### Axis = 1 | Concatenate along columns

In [9]:
axis1 = pd.concat([one,two],axis=1)
axis1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

###### Axis = 0 | Concatenate along rows (Columns match up)

In [10]:
data_three = {'A':['C0','C1','C2','C3'],
           'B':['D0','D1','D2','D3']}

In [12]:
three = pd.DataFrame(data_three)
three

    A   B
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [13]:
axis0_cols_match = pd.concat([one,three],axis=0)
axis0_cols_match

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

#### Merge

In [14]:
registrations = pd.DataFrame({'reg_id':[1,2,3,4],
                             'name':['A','B','C','D']})
logins = pd.DataFrame({'log_id':[1,2,3,4],
                      'name':['X','A','Y','B']})

In [15]:
registrations

   reg_id name
0       1    A
1       2    B
2       3    C
3       4    D

In [16]:
logins

   log_id name
0       1    X
1       2    A
2       3    Y
3       4    B

In [17]:
pd.merge(registrations,logins,how='inner',on='name')

   reg_id name  log_id
0       1    A       2
1       2    B       4

In [18]:
pd.merge(registrations,logins,how='inner')

   reg_id name  log_id
0       1    A       2
1       2    B       4

In [19]:
pd.merge(registrations,logins,how='left',on='name')

   reg_id name  log_id
0       1    A     2.0
1       2    B     4.0
2       3    C     NaN
3       4    D     NaN

In [20]:
pd.merge(registrations,logins,how='right',on='name')

   reg_id name  log_id
0     NaN    X       1
1     1.0    A       2
2     NaN    Y       3
3     2.0    B       4

In [21]:
pd.merge(registrations,logins,how='outer',on='name')

   reg_id name  log_id
0     1.0    A     2.0
1     2.0    B     4.0
2     3.0    C     NaN
3     4.0    D     NaN
4     NaN    X     1.0
5     NaN    Y     3.0

### Join on Index or Column

In [23]:
registrations = registrations.set_index('name')
registrations

      reg_id
name
A          1
B          2
C          3
D          4

In [24]:
logins

   log_id name
0       1    X
1       2    A
2       3    Y
3       4    B

In [25]:
pd.merge(registrations,logins,right_on='name',left_index=True)

   reg_id  log_id name
1       1       2    A
3       2       4    B

In [26]:
pd.merge(logins,registrations,left_on='name',right_index=True)

   log_id name  reg_id
1       2    A       1
3       4    B       2

###### Dealing with differing key column names in joined tables

In [29]:
registrations = registrations.reset_index()
registrations

  name  reg_id
0    A       1
1    B       2
2    C       3
3    D       4

In [30]:
registrations.columns = ['reg_name','reg_id']

In [31]:
registrations

  reg_name  reg_id
0        A       1
1        B       2
2        C       3
3        D       4

In [32]:
logins

   log_id name
0       1    X
1       2    A
2       3    Y
3       4    B

In [35]:
pd.merge(registrations,logins,how='inner',left_on='reg_name',right_on='name').drop('reg_name',axis=1)

   reg_id  log_id name
0       1       2    A
1       2       4    B

In [37]:
registrations.columns = ['name','id']
registrations

  name  id
0    A   1
1    B   2
2    C   3
3    D   4

In [38]:
logins.columns = ['id','name']
logins

   id name
0   1    X
1   2    A
2   3    Y
3   4    B

In [41]:
pd.merge(registrations,logins,how='inner',on='name')

  name  id_x  id_y
0    A     1     2
1    B     2     4

In [42]:
pd.merge(registrations,logins,how='inner',on='name',suffixes=('_reg','_logins'))

  name  id_reg  id_logins
0    A       1          2
1    B       2          4